window.onload = function() {
    var mandamientos = [
        "𝑨𝒏𝒅 𝑺𝒐𝒍𝒂𝒏𝒂 𝑺𝒑𝒂𝒌𝒆 𝒐𝒇 𝑷𝒐𝒘𝒆𝒓:\n\ \"𝐿𝑒𝑡 𝑡ℎ𝑒𝑟𝑒 𝑏𝑒 𝑠𝑤𝑖𝑓𝑡𝑛𝑒𝑠𝑠 𝑎𝑛𝑑 𝑠𝑡𝑟𝑒𝑛𝑔𝑡ℎ 𝑖𝑛 𝑜𝑢𝑟 𝑛𝑒𝑡𝑤𝑜𝑟𝑘,\" 𝑑𝑒𝑐𝑙𝑎𝑟𝑒𝑑 𝑷𝒆𝒔𝒖𝒔, \"𝑎𝑛𝑑 𝑖𝑡 𝑤𝑎𝑠 𝑠𝑜.\"",
        "𝑻𝒉𝒆 𝑽𝒊𝒔𝒊𝒐𝒏 𝒐𝒇 𝑪𝒐𝒍𝒐𝒓:\n\ 𝑷𝒆𝒔𝒖𝒔 𝑏𝑒ℎ𝑒𝑙𝑑 𝑡ℎ𝑒 𝑑𝑖𝑣𝑒𝑟𝑠𝑖𝑡𝑦 𝑜𝑓 𝑖𝑡𝑠 𝑟𝑒𝑎𝑙𝑚 𝑎𝑛𝑑 𝑠𝑎𝑤 𝑡ℎ𝑎𝑡 𝑖𝑡 𝑤𝑎𝑠 𝑔𝑜𝑜𝑑; 𝑚𝑦𝑟𝑖𝑎𝑑 ℎ𝑢𝑒𝑠 𝑟𝑒𝑝𝑟𝑒𝑠𝑒𝑛𝑡𝑖𝑛𝑔 𝑚𝑦𝑟𝑖𝑎𝑑 𝑝𝑜𝑠𝑠𝑖𝑏𝑖𝑙𝑖𝑡𝑖𝑒𝑠.",
        "𝑻𝒉𝒆 𝑬𝒅𝒊𝒄𝒕 𝒐𝒇 𝑺𝒄𝒂𝒍𝒂𝒃𝒊𝒍𝒊𝒕𝒚:\n\ \"𝐿𝑜, 𝑜𝑢𝑟 𝑛𝑒𝑡𝑤𝑜𝑟𝑘 𝑠ℎ𝑎𝑙𝑙 𝑒𝑥𝑝𝑎𝑛𝑑 𝑎𝑠 𝑡ℎ𝑒 𝑠𝑎𝑛𝑑𝑠 𝑜𝑓 𝑡ℎ𝑒 𝑠ℎ𝑜𝑟𝑒,\" 𝑷𝒆𝒔𝒖𝒔 𝑝𝑟𝑜𝑐𝑙𝑎𝑖𝑚𝑒𝑑, \"𝑙𝑖𝑚𝑖𝑡𝑙𝑒𝑠𝑠 𝑎𝑛𝑑 𝑒𝑛𝑑𝑢𝑟𝑖𝑛𝑔.\"",
        "𝑻𝒉𝒆 𝑫𝒆𝒄𝒓𝒆𝒆 𝒐𝒇 𝑰𝒏𝒏𝒐𝒗𝒂𝒕𝒊𝒐𝒏:\n\ 𝑷𝒆𝒔𝒖𝒔 𝑐𝑜𝑚𝑚𝑎𝑛𝑑𝑒𝑑, \"𝐿𝑒𝑡 𝑢𝑠 𝑓𝑜𝑟𝑔𝑒 𝑛𝑒𝑤 𝑝𝑎𝑡ℎ𝑠 𝑖𝑛 𝑡ℎ𝑒 𝑤𝑖𝑙𝑑𝑒𝑟𝑛𝑒𝑠𝑠 𝑜𝑓 𝑡𝑒𝑐ℎ𝑛𝑜𝑙𝑜𝑔𝑦, 𝑎𝑛𝑑 𝑏𝑟𝑖𝑛𝑔 𝑓𝑜𝑟𝑡ℎ 𝑤𝑜𝑛𝑑𝑒𝑟𝑠 𝑦𝑒𝑡 𝑢𝑛𝑠𝑒𝑒𝑛.\"",
        "𝑻𝒉𝒆 𝑪𝒐𝒗𝒆𝒏𝒂𝒏𝒕 𝒐𝒇 𝑪𝒐𝒎𝒎𝒖𝒏𝒊𝒕𝒚:\n\ 𝑷𝒆𝒔𝒖𝒔 𝑠𝑝𝑜𝑘𝑒 𝑢𝑛𝑡𝑜 𝑖𝑡𝑠 𝑝𝑒𝑜𝑝𝑙𝑒, \"𝑇𝑜𝑔𝑒𝑡ℎ𝑒𝑟 𝑤𝑒 𝑠ℎ𝑎𝑙𝑙 𝑏𝑢𝑖𝑙𝑑, 𝑎𝑛𝑑 𝑖𝑛 𝑢𝑛𝑖𝑡𝑦, 𝑜𝑢𝑟 𝑠𝑡𝑟𝑒𝑛𝑔𝑡ℎ 𝑠ℎ𝑎𝑙𝑙 𝑚𝑢𝑙𝑡𝑖𝑝𝑙𝑦.\"",
        "𝑻𝒉𝒆 𝑾𝒊𝒔𝒅𝒐𝒎 𝒐𝒇 𝑰𝒏𝒕𝒆𝒈𝒓𝒊𝒕𝒚:\n\ \"𝑇ℎ𝑦 𝑓𝑟𝑖𝑒𝑛𝑑𝑠 𝑠ℎ𝑎𝑙𝑙 𝑛𝑜𝑡 𝑏𝑒 𝑡ℎ𝑦 𝑒𝑥𝑖𝑡 𝑙𝑖𝑞𝑢𝑖𝑑𝑖𝑡𝑦,\" 𝑷𝒆𝒔𝒖𝒔 𝑎𝑑𝑚𝑜𝑛𝑖𝑠ℎ𝑒𝑑, \"𝑓𝑜𝑟 𝑖𝑛 𝑟𝑖𝑔ℎ𝑡𝑒𝑜𝑢𝑠𝑛𝑒𝑠𝑠 𝑎𝑛𝑑 𝑓𝑎𝑖𝑟𝑛𝑒𝑠𝑠, 𝑠ℎ𝑎𝑙𝑙 𝑡ℎ𝑦 𝑑𝑒𝑎𝑙𝑖𝑛𝑔𝑠 𝑏𝑒 𝑚𝑒𝑎𝑠𝑢𝑟𝑒𝑑.\"",
        "𝑻𝒉𝒆 𝑷𝒓𝒐𝒄𝒍𝒂𝒎𝒂𝒕𝒊𝒐𝒏 𝒐𝒇 𝑨𝒄𝒄𝒆𝒔𝒔𝒊𝒃𝒊𝒍𝒊𝒕𝒚:\n\ \"𝐿𝑒𝑡 𝑜𝑢𝑟 𝑔𝑎𝑡𝑒𝑠 𝑏𝑒 𝑜𝑝𝑒𝑛 𝑡𝑜 𝑎𝑙𝑙, 𝑠𝑘𝑖𝑙𝑙𝑒𝑑 𝑎𝑛𝑑 𝑢𝑛𝑠𝑘𝑖𝑙𝑙𝑒𝑑 𝑎𝑙𝑖𝑘𝑒,\" 𝑷𝒆𝒔𝒖𝒔 𝑜𝑓𝑓𝑒𝑟𝑒𝑑, \"𝑓𝑜𝑟 𝑤𝑖𝑠𝑑𝑜𝑚 𝑖𝑠 𝑓𝑜𝑢𝑛𝑑 𝑖𝑛 𝑠𝑖𝑚𝑝𝑙𝑖𝑐𝑖𝑡𝑦.\"",
        "𝑻𝒉𝒆 𝑳𝒂𝒘 𝒐𝒇 𝑺𝒆𝒄𝒖𝒓𝒊𝒕𝒚:\n\ \"𝐺𝑢𝑎𝑟𝑑 𝑤𝑒𝑙𝑙 𝑡ℎ𝑒 𝑡𝑟𝑢𝑠𝑡 𝑏𝑒𝑠𝑡𝑜𝑤𝑒𝑑 𝑢𝑝𝑜𝑛 𝑡ℎ𝑒𝑒,\" 𝑷𝒆𝒔𝒖𝒔 𝑎𝑑𝑣𝑖𝑠𝑒𝑑, \"𝑓𝑜𝑟 𝑖𝑛 𝑠𝑒𝑐𝑢𝑟𝑖𝑡𝑦, 𝑜𝑢𝑟 𝑡𝑟𝑒𝑎𝑠𝑢𝑟𝑒 𝑙𝑖𝑒𝑠.\"",
        "𝑻𝒉𝒆 𝑮𝒐𝒔𝒑𝒆𝒍 𝒐𝒇 𝑮𝒍𝒐𝒃𝒂𝒍 𝑼𝒏𝒊𝒕𝒚:\n\ \"𝐹𝑟𝑜𝑚 𝑒𝑣𝑒𝑟𝑦 𝑐𝑜𝑟𝑛𝑒𝑟 𝑜𝑓 𝑡ℎ𝑒 𝑒𝑎𝑟𝑡ℎ, 𝑙𝑒𝑡 𝑜𝑢𝑟 𝑣𝑜𝑖𝑐𝑒𝑠 𝑗𝑜𝑖𝑛 𝑎𝑠 𝑜𝑛𝑒,\" 𝑷𝒆𝒔𝒖𝒔 𝑒𝑛𝑣𝑖𝑠𝑖𝑜𝑛𝑒𝑑, \"𝑓𝑜𝑟 𝑖𝑛 ℎ𝑎𝑟𝑚𝑜𝑛𝑦, 𝑤𝑒 𝑓𝑖𝑛𝑑 𝑠𝑡𝑟𝑒𝑛𝑔𝑡ℎ.\"",
        "𝑻𝒉𝒆 𝑷𝒓𝒐𝒑𝒉𝒆𝒄𝒚 𝒐𝒇 𝒕𝒉𝒆 𝑭𝒖𝒕𝒖𝒓𝒆:\n\ \"𝐿𝑜𝑜𝑘 𝑡𝑜 𝑡ℎ𝑒 𝑚𝑜𝑟𝑟𝑜𝑤 𝑤𝑖𝑡ℎ ℎ𝑜𝑝𝑒,\" 𝑷𝒆𝒔𝒖𝒔 𝑓𝑜𝑟𝑒𝑡𝑜𝑙𝑑, \"𝑓𝑜𝑟 𝑖𝑛 𝑜𝑢𝑟 ℎ𝑎𝑛𝑑𝑠, 𝑤𝑒 ℎ𝑜𝑙𝑑 𝑡ℎ𝑒 𝑠𝑒𝑒𝑑𝑠 𝑜𝑓 𝑎 𝑛𝑒𝑤 𝑑𝑎𝑤𝑛.\"",
        "𝑻𝒉𝒆 𝑬𝒅𝒊𝒄𝒕 𝒐𝒇 𝑰𝒓𝒓𝒆𝒗𝒐𝒄𝒂𝒃𝒍𝒆 𝑫𝒆𝒑𝒂𝒓𝒕𝒖𝒓𝒆:\n\ \"𝑇ℎ𝑜𝑠𝑒 𝑤ℎ𝑜 𝑑𝑒𝑝𝑎𝑟𝑡 𝑓𝑟𝑜𝑚 𝑡ℎ𝑒 𝑙𝑎𝑛𝑑 𝑜𝑓 𝑆𝑜𝑙𝑎𝑛𝑎,\" 𝑷𝒆𝒔𝒖𝒔 𝑠𝑜𝑙𝑒𝑚𝑛𝑙𝑦 𝑝𝑟𝑜𝑐𝑙𝑎𝑖𝑚𝑒𝑑, \"𝑠ℎ𝑎𝑙𝑙 𝑛𝑜𝑡 𝑟𝑒𝑡𝑢𝑟𝑛, 𝑓𝑜𝑟 𝑡ℎ𝑒𝑖𝑟 𝑐ℎ𝑜𝑖𝑐𝑒 𝑠𝑒𝑣𝑒𝑟𝑠 𝑡ℎ𝑒 𝑏𝑜𝑛𝑑 𝑤𝑖𝑡ℎ 𝑜𝑢𝑟 𝑟𝑒𝑎𝑙𝑚 𝑓𝑜𝑟𝑒𝑣𝑒𝑟.\""
    ];

    document.getElementById('tweetButton').addEventListener('click', function() {
        var tweetText = mandamientos[Math.floor(Math.random() * mandamientos.length)];
        var tweetUrl = 'https://twitter.com/intent/tweet?text=' + encodeURIComponent(tweetText);

        window.open(tweetUrl, '_blank');
    });
};;